{"The noise from hitting the ground is loud, and you may worry about damaging or scratching the floor.":"1. Positive expression We have made universal wheel spring shock absorption treatment to reduce the noise of hitting the ground; asynchronous obstacle crossing action will effectively reduce the sound of hitting the ground; the current obstacle crossing noise is consistent with the obstacle crossing sound of conventional sweepers. \n2. Universal wheel spring shock absorption design will buffer the impact of hitting the ground and effectively protect the floor. \n3. The main brush cover and small wheels are designed with soft rubber material. At the same time, the product has been tested for a long time in various complex environments and will not cause direct scratches on the ground.","The upper cover is damaged/scratched":"If the new machine is damaged after unpacking, please ask the user to provide photos of the damage and the SN number of the host. The customer service center will feedback the photos and SN number to MOVA after-sales service and provide return or replacement of the upper cover + gifts/extended warranty in accordance with the DOA method.","Button failure":"1. Determine whether all or a single key is malfunctioning.\n2 Check whether the upper cover is installed in place.\n3.Is the problem solved after resetting the machine?\n4.Guide users to send the keypad and mainboard for repair and inspection.\nSpare parts involved: keypad, host motherboard","The dust box is installed normally, but the host gives a voice prompt that the dust box is not in place.":"1.Check whether the filter is clogged. The dust box has not been cleaned for a long time or the filter is damp and not dried. Please dry the filter completely before use.\n2.If the dust box cannot be detected, check whether the dust box is properly installed and whether the filter has magnets;\n3.Reset the machine. If the problem is not solved, please send it to a repair center.\nRepair Center:\n4.whether the Hall detection harness is installed properly. Cross-check the Hall detection harness assembly. If the harness is faulty, replace the Hall detection assembly.\n5.Check and replace the right transfer plate and the right transfer plate harness;\nReplace the system board.","The dust box detection is unstable, and the cleaning process stops abnormally. The voice broadcast asks me to install the dust box;":"1.Check whether the filter is clogged. The dust box has not been cleaned for a long time or the filter is damp and not dried. Please dry the filter completely before use.\n2.If the dust box cannot be detected, check whether the dust box is properly installed and whether the filter has magnets;\n3.Reset the machine. If the problem is not solved, please send it to a repair center.\nRepair Center:\n4.whether the Hall detection harness is installed properly. Cross-check the Hall detection harness assembly. If the harness is faulty, replace the Hall detection assembly.\n5.Check and replace the right transfer plate and the right transfer plate harness;\nReplace the system board.","The main brush makes abnormal noise":"1.Check whether there is any foreign object entangled in the main brush and clean it up ;\n2.If there is a spare main brush, you can cross-test\n3.If the above cannot solve the problem, manually rotate the main brush to determine if it is an abnormal sound from the main brush gearbox, and send it for repair to replace the main brush assembly;","The main brush does not rotate/the voice broadcast indicates that the main brush is abnormal. Please check and clean the main brush.":"1.Check whether there is any foreign object entangled in the main brush and remove it ;\n2.If the error message persists, replace the main brush with a new one for cross-testing;\n3.If the error persists, reset the machine\n4.If replacing the main brush assembly still does not solve the problem, send it back to the repair center to replace the main board.\nSpare parts involved: main brush, main brush assembly, main board","Voice broadcast \"Please try to clear the cliff sensor\"":"1. Check if the cliff sensor window is dirty;\n2.Reset the machine. If the problem persists, send it to a repair center for repair.\n3.Open your phone's camera and point it at the cliff sensor to see if you can see the ultraviolet light emitted. Which one is not lit? Replace it. Cliff sensor test\n4.If all four lights are on, replace the mainboard and test\nSpare parts involved : cliff sensor, main board","After the machine is started, it moves abnormally, keeps moving backward or circling, and the voice broadcast says that the collision plate is abnormal. Please tap the collision plate to check whether it rebounds.":"1.Check if the front striker is stuck (usually one side is stuck and difficult to rebound, resulting in continuous triggering)\n2.Check whether the front impact spring is deformed and rebounds normally. If there is no abnormality, please send it back to the repair center for inspection.\n3.Remove the front collision assembly and enter the BIT test to determine whether the left side or the right side is defective, whether the structural parts are intact, whether the assembly is normal, and whether it can pop up normally when pressed.\n5.Replace the system board.\nSpare parts involved : front collision plate, main board","When the machine is not suspended, start cleaning , and the voice broadcasts that the host is suspended, please put me back to the ground":"1.Reset the machine\n2.If it cannot be repaired, send it back to the repair center to replace the drive wheel and the main board for cross-testing\nSpare parts involved : drive wheel, micro switch, main board","Left drive wheel abnormality":"1.The user should check whether there is any foreign object stuck on the driving wheel and clean the driving wheel with wet wipes or rags.\n2.Reset the machine\n3.If it cannot be repaired, please send it back to the repair center and use the serial port tool to test whether the drive wheel rotates normally. If the wheel can rotate, replace the mainboard; if the wheel cannot rotate, replace the drive wheel first.\nSpare parts involved : drive wheel, main board","Right drive wheel abnormality, please check and clean the drive wheel":"1.The user should check whether there is any foreign object stuck on the driving wheel and clean the driving wheel with wet wipes or rags.\n2.Reset the machine\n3.If it cannot be repaired, please send it back to the repair center and use the serial port tool to test whether the drive wheel rotates normally. If the wheel can rotate, replace the mainboard; if the wheel cannot rotate, replace the drive wheel first.\n\nSpare parts involved : drive wheel, main board","Fan abnormal noise":"1. Take out the dust box and clean the foreign matter inside the dust box and dust box bin.\n2. If it cannot be repaired, send it for repair and replace the fan\nSpare parts involved : fan","The host has no suction/The filter is error":"1.Take out the dust box and clean the foreign matter inside the dust box and dust box bin.\n2.Take out the main brush and clean it\n3.Continue troubleshooting according to the video: https://www.youtube.com/shorts/RRMPDjZuVcY\n4.https://www.youtube.com/shorts/j7TBRTCKoI0\n5.If the above troubleshooting fails to identify the cause, please send the product back to the repair center for inspection.\nSpare parts involved : fan, mainboard","Side brush makes abnormal noise":"1. Clear the side brush entanglement\n2. If there is a spare side brush, replace it and test it. If the noise is still abnormal, please send it to the repair center to replace the side brush motor.\n3. If there is no spare side brush cross test, send it directly back to the repair center for testing.\nSpare parts involved : side brush, side brush motor assembly","The brush does not rotate or swing outwards":"1. Clean the side brush\n2. If you have a spare side brush, replace it and test it. If it still does not turn, please send it to the repair center for inspection.\n3. If there is no spare side brush, send it directly back to the repair center for testing.\nSpare parts involved : side brush, side brush motor assembly, main board","the host keeps spinning in place":"1. Share the host with after-sales service to calibrate the IMU and restart the machine for testing\n2. If it cannot be restored, send it directly back to the repair center for testing\nSpare parts involved : Mainboard","The host reports a tilt prompt, please put it on a level surface":"1. Share the host with after-sales service to calibrate the IMU and restart the machine for testing\n2. If it cannot be restored, send it directly back to the repair center for testing\nSpare parts involved : Mainboard","The host has no sound":"1. Reset the machine\n2. If it doesn’t work, send it back to the repair center for testing\nSpare parts involved : motherboard, speakers","the volume cannot be adjusted":"1. Reset the machine\n2. If it doesn’t work, send it back to the repair center for testing\nSpare parts involved : motherboard, speakers","The sound is low":"1. Reset the machine\n2. If it doesn’t work, send it back to the repair center for testing\nSpare parts involved : motherboard, speakers","Unable to boot":"1. Manually put the host back to the base station and wait for the host to start up\n2. Test whether the power button, charge button and reset button are normal\n3. If all the above cannot be done, please send it back to the repair center for testing.\nSpare parts involved : main board, key board, reset board","The rag falls off":"1.Check if the rag holder is magnetic\n2.Reset the machine\n3.If not, contact after-sales service for raw material calibration\n4.If the calibration fails, send it back to the repair center for testing.\nSpare parts involved : rag plate, rag motor, main board","The rag does not rotate":"1.Reset the machine\n2.If resetting the machine does not solve the problem, send it directly to the repair center for testing\nSpare parts involved : mop motor, main board","the rag does not swing out properly":"1.Reset the machine\n2.If resetting the machine does not solve the problem, send it directly to the repair center for testing\nSpare parts involved : mop motor, main board","The machine is spinning in circles":"1. Wipe the edge sensor\n2. Reset the machine\n3. If all cannot be repaired, send it back to the repair center for testing\nSpare parts involved : edge sensor, main board, wiring harness","The vacuum cleaner cannot clean along the edges":"1. Wipe the edge sensor\n2. Reset the machine\n3. If all cannot be repaired, send it back to the repair center for testing\nSpare parts involved : edge sensor, main board, wiring harness","The laser sensor is abnormal":"1. Wipe the LDS sensor\n2. Reset the machine\n3. If all cannot be repaired, send it back to the repair center for testing\nSpare parts involved : LDS sensor, main board, wiring harness","The host does not move in a straight line":"1. Wipe the LDS sensor\n2. Reset the machine\n3. Contact after-sales service for calibration\n4. If the product cannot be repaired, send it back to the repair center for testing\nSpare parts involved : LDS sensor, main board, wiring harness","The host cannot recharge normally":"1. Wipe the LDS sensor\n2. Reset the machine\n3. Contact the after-sales center for remote calibration\n4. If the product cannot be repaired, send it back to the repair center for testing\nSpare parts involved : LDS sensor, main board, wiring harness","Unable to identify obstacles":"1. Wipe the impact plate\n2. Reset the machine and upgrade to the latest version\n3. If all cannot be repaired, send it back to the repair center for testing\nSpare parts involved : AI camera, mainboard, crash board","Unable to avoid obstacles normally":"1. Wipe the impact plate\n2. Reset the machine and upgrade to the latest version\n3. Use your phone camera to shoot the line laser to see if there is a red laser emitted\n4. If it cannot be repaired, send it back to the repair center for testing\nSpare parts involved : line laser, main board, collision board, front recharge component","No sewage absorption":"1. Clean the sewage outlet of the base station\n2. Press the sewage tank cover with your hand to see if the sewage can be sucked out. If so, reissue the sewage tank. If not, send it back to the repair center for testing.\n3. User reference: https://www.youtube.com/watch?v=slVqKUfQKmM\nSpare parts involved : sewage tank, sewage pump, base station control board","The sewage tank is abnormal":"1. Clean the sewage outlet of the base station\n2. Press the sewage tank cover with your hand to see if the sewage can be sucked out. If it can, reissue the sewage tank. If not, send it back to the repair center for testing.\n3. User reference: https://www.youtube.com/watch?v=slVqKUfQKmM\nSpare parts involved : sewage tank, sewage pump, base station control board","Abnormal water level in clean water tank":"1. Make sure there is enough water in the clean water tank\n2. Check whether the Hall sensor of the clean water tank is in place and has magnetism\n3. If there is no abnormality in the water tank, it needs to be sent back to the repair center to replace the Hall sensor or base station control board\n4.Spare parts involved : clean water tank, Hall sensor, base station control board","The base station cannot be turned on":"1. Make sure the base station is switched on. Replace the socket\n2. If you have a multimeter, you can test whether the voltage at the output end of the adapter is AC220V. If not, reissue the power cord.\n3. If the adapter layer output voltage is normal, it needs to be sent back to the repair center for testing.\nSpare parts involved : power board, adapter, base station control board, switch button","APP reports an error that the dust bag is not installed":"1. Confirm that the base station is powered on and can be used normally\n2. The user checks whether the dust bag micro switch is in place, refer to the video: https://www.youtube.com/shorts/_za-KU4XeM4\n3. If the switch is in place, you can try changing the dust bag. If the switch falls off or changing the dust bag does not solve the problem, send it back to the repair center for inspection.\nSpare parts involved : dust bag, micro switch, base station control board","Base station cleaning fluid is not consumed":"1. Check whether the cleaning liquid box opening is blocked\n2. Clean the cleaning liquid box, turn off the base station for 5 minutes and then turn it on for testing.\n3. If the problem cannot be solved, send it back to the repair center for testing\nSpare parts involved : cleaning liquid box, peristaltic pump, base station control board","No clean water is produced when washing rags":"1. Test with a new solution tank.\n2. Send the device back to the repair center for disassembly and inspection\nSpare parts involved : water pipe, two-position three-way valve, base station control panel, clean water pump, clean water tank","the small water tank of the host does not fill with water, and no water is produced when the base station is self-cleaning":"1. Test with a new solution tank.\n2. Send the device back to the repair center for disassembly and inspection\nSpare parts involved : water pipe, two-position three-way valve, base station control panel, clean water pump, clean water tank","The rag does not absorb the dirty water when washing":"1. Test with a new solution tank.\n2. Send the device back to the repair center for disassembly and inspection\nSpare parts involved : water pipes, base station control panel, sewage pump, sewage tank","Smart mop does not clean properly":"1. Send it directly to the repair center for repair\nSpare parts involved : water pipe, turbidity detection, base station control board","The host cannot be recharged normally":"1. Try another host or base station to determine if the problem is with the base station or the host.\n2. For host problems, refer to LDS component box host recharge component troubleshooting\n3. Base station problem: Wipe the infrared cover of the base station to recharge.\n4. Check whether the base station extension plate is non-slip, wipe it clean and test it\n5. If the problem cannot be solved, please send the base station back to the repair center.\nSpare parts involved : base station extension board, base station infrared recharging component, base station control board","There is no hot air drying after washing the rag":"1.Turn off the base station for 5 minutes and then restart it to test again\n2.If it still doesn't work, send it back to the repair center directly\nSpare parts involved : base station power board, base station control board, base station PTC heating component","There is no hot water when washing the rag":"1.Turn off the base station for 5 minutes and then restart it to test again\n2.If it still doesn't work, send it back to the repair center directly\nSpare parts involved : base station power board, base station control board, base station instant heating components","The dust box of the host is blocked":"1.Replace dust box test\n2.If the problem cannot be solved after replacing the dust box, send it back to the repair center directly\nSpare parts involved : base station fan, base station power board, host dust box, base station pipeline","The host pops out after being connected to the pile/the host cannot be charged after being put back to the base station manually":"1. Wipe the rechargeable electrodes of the host and base station\n2. Use a multimeter to test whether the voltage of the base station electrode is 10V±1V. The voltage of the host should be 20V±1V when charging at the base station. If the voltage is incorrect, check the electrode assembly or the base station control board.\nSpare parts involved : base station power board, base station control board, base station charging pole piece","Please check whether the main wheel is stuck with foreign objects and move it to a new position to start":"1. Wipe the drive wheel and check if there is any foreign object stuck on the drive wheel.\n2. Reset the machine. If it cannot be repaired, send it back to the repair center for inspection.\nSpare parts involved : drive wheel assembly, host motherboard","Upgrade Failure":"1. Make sure the host battery is greater than 30%\n2. Make sure the host is charging normally on the base station\n3. Try changing the network\n4. Reset the machine\n5. If the problem cannot be solved, send it back to the repair center for inspection\nSpare parts involved : host motherboard","If the collision board is abnormal, please tap the collision board to check whether it rebounds.":"1. Press the front bumper with your hand . The front bumper of the machine can be easily pressed in. After releasing your hand, the front shell will bounce back easily. The movement should be free of interference and friction. If the front bumper rebounds poorly, please check whether there are any foreign objects stuck or stuck in the gap between the front shell and the base and the cover, causing friction and interference .\n2. Send the machine back to the repair center for disassembly and check whether the front impact shrapnel is deformed or entangled by the wiring harness\n3. Replace the front bumper or main board\nSpare parts involved : host motherboard, front collision plate","The specified area cannot be reached":"1. Check if there are any obstacles or doors blocking the cleaning route\n2. Check if the map is overlaid\n3. Reset the machine and rebuild the map\n4. Contact MOVA after-sales remote assistance\nSpare parts involved : software, LDS, environmental reasons","The host is tilted, please put it on the level ground and restart it":"1. Restart the machine\n2. Contact MOVA after-sales service to remotely calibrate the IMU\n3. Reset the machine\n4. If the problem cannot be solved, send it back to the repair center\nSpare parts involved : Mainboard","Please check whether there is any foreign matter at the laser sensor position":"1. Wipe the LDS laser transmitting and receiving ports\n2. Gently tap the LDS cover\n3. Restart the machine\n4. Contact MOVA after-sales service for remote calibration\n5. Send it back to the repair center for inspection\nSpare parts involved : Mainboard, LDS","The main brush is abnormal, please check and clean the main brush":"1. Wipe the main brush or replace it with a new one\n2. Take out the main brush and see if the machine is working properly\n3. Reset the machine\n4. Send it back to the repair center for inspection\nSpare parts involved : main brush, main board","The side brush is abnormal, please check and clean the side brush":"1. Wipe the side brush or replace the main brush\n2. Reset the machine\n3. Send it back to the repair center for inspection\nSpare parts involved : side brush, main board","Fan abnormality":"1. Replace the new dust box and test\n2. Reset the machine\n3. Send it back to the repair center for inspection\nSpare parts involved : fan, mainboard, dust box filter","Dust box abnormality":"1. Replace the new dust box and test\n2. Reset the machine\n3. Send it back to the repair center for inspection\nSpare parts involved : Hall sensor, main board, dust box filter","Child lock is on and buttons are locked":"1. Turn off the child lock on the APP\n2. Resetting the machine can also solve the problem\n3. Send it back to the repair center for inspection\nSpare parts involved : Mainboard","The new machine cannot be activated and cannot be configured for network":"1.Confirm that the WIFI is 2.4 GHz or use a mobile phone hotspot as a wifi test. The mobile phone wifi must be set to 2.4 GHz\n2. Restart your router\n3. Reset the machine\n4. Send it back to the repair center to replace the mainboard\nSpare parts involved : Mainboard","Rotating mop failure":"1.Confirm that the WiFi is 2.4 GHz\n2. Restart your router\n3. Reset the machine\n4. Send it back to the repair center to replace the mainboard\nSpare parts involved : Mainboard","Unable to turn on or charge":"1.Replace the base station and power cord test\n2. The host button is faulty. Put the host into the base station manually to test whether it can be turned on and charged.\n3. Reset the machine\n4. Send it back to the repair center for inspection\nSpare parts involved : mainboard, buttons, keypad, battery, electrode sheet, power cord","Unable to recharge (can be charged manually)":"1. Replace the base station or host and perform a cross-test to confirm that the problem is with the base station or host.\n2. If the host has a problem, you need to clean the host and base station recharge components, and clean the drive wheels and universal wheels.\n3. If the problem cannot be fixed, try resetting the console.\n4. If there is a problem with the base station, you need to clean the host and base station recharge components, and wipe the extension board.\nSpare parts involved : main board, recharge components, drive wheel slippage, extension board slippage","Host Spinning":"1.Foreign matter stuck in the driving wheel: Clean the driving wheel\n2.The striker plate is stuck: Check the striker plate\n3.LDS collision board is stuck: tap the collision board\n4.Dirty sensor: Wipe the sensor\n5.Reset the machine. If the problem persists, send it back to the repair center.","Host abnormal sound":"1.The sound of friction between the roller brush cover and the ground.\n2.Universal wheel breaks and produces noise\n3.Foreign objects in the rolling card cause noise\n4.Wet filter causes noise\n5.Fan failure causing noise\n6.The drive wheel makes noise\n7.The mop motor makes noise\n8.If the source of the noise cannot be determined, send it back to the repair center for inspection.","Host hanging alarm":"1.Downward vision sensor abnormality\n2.Wipe down sensor\n3.Reset the machine\n4.If it cannot be restored, send it back to the repair center for testing","Driving wheel hanging warning":"1.Turn off the machine and check whether there is any foreign object entangled in the drive wheel.\n2.Press the drive wheel and hear a slight clicking sound.\n3.Reset the machine\n4.If it cannot be restored, send it back to the repair center for testing","Map overlap/map distortion/routes confusion":"1.Check if the version is the latest one\n2.Check if the home is affected by sunlight/pure black skirting/transparent glass/floor drain\n3.Check if the floor is too oily and causing slippage\n4.Wipe LDS and other sensors, contact Dreamie after-sales service to remotely calibrate LDS\n5.Reset the machine and rebuild the map\n5.If it cannot be restored, send it back to the repair center for testing","Rag falls off":"1.The host version is upgraded to the latest version, and the APP turns on the mop swing button\n2.After installing the rag, do you hear \"rag installed\"? If not, reinstall it.\n3.Check the location of the detachment to see if it was caused by the table leg power cord scratching it.\n4.Reset the machine\n6.If it cannot be restored, send it back to the repair center for testing","Side brush motor abnormality":"1.The console version is upgraded to the latest version, and the APP has turned on the side brush swing button\n2.Reset the machine\n3.If it cannot be restored, send it back to the repair center for testing","No clean water from the base station":"1.Replacement of fresh water tank test\n2.If it cannot be restored, send it back to the repair center for testing","Base stations do not absorb sewage":"1.Replace the sewage tank test\n2.Clean the sewage outlet\n3.If it cannot be restored, send it back to the repair center for testing","Water leakage at base station":"1.Send it directly to the repair center for disassembly and inspection","The host does not absorb dust":"1.Clean the main brush and dust box\n2.Clean the filter and make sure it is completely dry before use\n3.Follow the youtube video to check:\nhttps://www.youtube.com/shorts/RRMPDjZuVcY\nhttps://www.youtube.com/shorts/j7TBRTCKoI0","There is an obvious mechanical movement sound when the mechanical foot is lifted when overcoming obstacles and when it is retracted after overcoming obstacles.":"The technological design reflects the technological sense of mechanical foot extension"}
